# Pandas tricks

## Imports and loads

In [1]:
import pandas as pd
import numpy as np
import sys

drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

/var/folders/q8/ngs87hxs20bgtqz6tx31wks40000gn/T/ipykernel_72718/2578782927.py:8: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')

In [2]:
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

## 1. Show installed versions

In [3]:
pd.__version__

'1.5.3'

In [4]:
pd.show_versions()

/Users/waltdhill/anaconda3/lib/python3.11/site-packages/_distutils_hack/__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.11.4.final.0
python-bits      : 64
OS               : Darwin
OS-release       : 22.6.0
Version          : Darwin Kernel Version 22.6.0: Wed Jul  5 22:22:05 PDT 2023; root:xnu-8796.141.3~6/RELEASE_ARM64_T6000
machine          : arm64
processor        : arm
byteorder        : little
LC_ALL           : None
LANG             : en_US.UTF-8
LOCALE           : en_US.UTF-8

pandas           : 1.5.3
numpy            : 1.24.3
pytz             : 2022.7
dateutil         : 2.8.2
setuptools       : 68.0.0
pip              : 23.2.1
Cython           : None
pytest           : 7.4.0
hypothesis       : None
sphinx           : 5.0.2
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : 4.9.2
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.12.0
pandas_datareader: None
bs4              : 4.12.2
bottleneck       : 1.3.5
brotli           :
fastparquet      : None
fsspec           : 2023.4.0
gcsfs            : None
matplotlib       : 3.7.1
numba            : 0.57.0
numexpr          : 2.8.4
odfpy            : None
openpyxl         : 3.0.10
pandas_gbq       : None
pyarrow          : 11.0.0
pyreadstat       : None
pyxlsb           : None
s3fs             : 2023.4.0
scipy            : 1.10.1
snappy           :
sqlalchemy       : 1.4.39
tables           : 3.8.0
tabulate         : 0.8.10
xarray           : 2023.6.0
xlrd             : None
xlwt             : None
zstandard        : 0.19.0
tzdata           : None

## 2. Create example DataFrame

In [5]:
# pass dict to df constructor (keys: col names, vals: col values)
df = pd.DataFrame({'col one':[100, 200], 'col two':[300,400]})
df

   col one  col two
0      100      300
1      200      400

In [6]:
# df with random data: 4 rows, 8 cols
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.958061,0.009644,0.299252,0.910880,0.811590,0.237765,0.876224,0.830121
1,0.423970,0.452116,0.985319,0.834499,0.696304,0.546614,0.107490,0.319395
2,0.816652,0.774675,0.376044,0.961606,0.277969,0.286934,0.627846,0.945031
3,0.689089,0.910921,0.449506,0.542686,0.287365,0.457639,0.859405,0.702474

In [7]:
# pass string with 8 chars, those can become col names
pd.DataFrame(np.random.rand(4,8), columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.072120,0.548323,0.378999,0.262035,0.845129,0.568944,0.672540,0.573422
1,0.338757,0.875614,0.874313,0.956775,0.141946,0.352549,0.907067,0.380009
2,0.585934,0.307951,0.506194,0.025954,0.228574,0.552369,0.560069,0.603971
3,0.554587,0.754093,0.184804,0.969621,0.912512,0.991443,0.556100,0.127457

## 3. Rename columns

### 3.1 Remove whitespace in column names

In [8]:
df = pd.DataFrame({'col one':[100, 200], 'col two':[300,400]}) # reset df
df

   col one  col two
0      100      300
1      200      400

#### Three subtly different methods

These three methods have identical results (remove the whitespace), but each is suited to a subtly different case:

1.  Pass a dictionary of column names. Good for renaming **any number of columns**.
2.  Overwrite `.columns` attribute. Good for **renaming all columns**
3.  **Replace a specific character** in all column names using the `.str.replace(<from>, <to>)` method

In [9]:
option = 3 # user 

df = pd.DataFrame({'col one':[100, 200], 'col two':[300,400]}) # reset df

if option == 1:
    # pass dict to rename: (keys: old col names, vals: new col names). specify axis.
    # can RENAME ANY NUMBER of columns
    print('opt 1:')
    df = df.rename({'col one':'col_one', 'col two':'col_two'}, axis='columns')

elif option == 2:
    print('opt 2:')
    # to RENAME ALL COLUMNS at once (overwrite .columns attribute)
    df.columns = ['col_one', 'col_two']

elif option == 3:
    print('opt 3:')
    # to REPLACE CHARACTER in column names (space -> underscore)
    df.columns = df.columns.str.replace(' ', '_')

df

opt 3:

   col_one  col_two
0      100      300
1      200      400

### 3.2. Add prefix or suffix to all column names

In [10]:
# prefixes and suffixes can obviously be added individually
df.add_prefix('X_').add_suffix('_Y')
# df.add_suffix('_Y')

   X_col_one_Y  X_col_two_Y
0          100          300
1          200          400

## 4. Reverse...

### 4.1 Reverse row order

In [11]:
# average alcohol consumption by country
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [12]:
option = 1 # user

if option == 1:
    # Reverse order without resetting index 
    print('opt 1')
    df_temp = drinks.loc[::-1]
    
elif option == 2:
    # Reset the index col
    # drop=False would save the original index as a new column (instead of dropping)
    print('opt 2:')
    df_temp = drinks.loc[::-1].reset_index(drop=True)

df_temp.head()

opt 1

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America

#### Notes
-   The slicing notation to reverse a dataframe's rows in `.loc` above is identical to reversing rows of a python list
-   With `.loc`, "all columns" are selected by default and don't need to be indexed in the slice
    -   i.e. `drinks.loc[::-1,:]` would work, but the `,:` is redundant!

### 4.2 Reverse column order
**Note, however,** the `:'` is required in `.loc` and cannot be omitted

-   i.e. while "all columns" are selected implicitly (by default) in `.loc`,
-   **"all rows" must be explicitly selected in the index**

In [13]:
drinks.loc[:, ::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

## 5. Select columns by data type...

In [14]:
drinks.dtypes # view all data types in the df

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

##### Using `.select_dtypes` to select columns by data type

1.  `include='number'` includes columns with both int and float types
2.  `include='object'` selects objects (e.g. string cols)
3.  list of data types desired
4.  `exclude='number'` excludes the type you don't want

In [15]:
option = 1 # user

if option == 1:
    # only numeric data (int and float)
    print('opt 1')
    df_temp = drinks.select_dtypes(include='number')
    
elif option == 2:
    print('opt 2')
    # only string data (e.g. strings)
    df_temp = drinks.select_dtypes(include='object')
    
elif option == 3:
    # list of desired data types to include
    print('opt 3')
    df_temp = drinks.select_dtypes(include=['number', 'object', 'category', 'datetime'])

elif option == 4:
    # list of desired data types to exclude
    print('opt 4')
    df_temp = drinks.select_dtypes(exclude='number')

df_temp.head()

opt 1

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

## 6. Convert strings to numbers using `.astype()`

In [16]:
df = pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-']})
df.dtypes # all 'objects' since the numbers are stored as strings

col_one      object
col_two      object
col_three    object
dtype: object

##### Change dtypes with `.astype()` or `to_numeric` - the latter can also deal with _type_ errors

###### Notes about `.astype()`:
-   It is applied on the **entire dataframe** here
-   Changes are **not made in place**

In [17]:
# change data types for COMPLETE columns by passing a dict col_name:var_type
df.astype({'col_one':'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

###### Note `to_numeric()` **also does not update values in place** just like `.astype()`

In [18]:
# third col contains a '-'. pd cannot deal with this. use to_numeric() to handle it
# OUTPUT: SERIES
pd.to_numeric(df.col_three, errors='coerce') # changes "errors" to NaNs
pd.to_numeric(df.col_three, errors='coerce').fillna(0) # makes NaNs to 0s

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

#### Use `.apply()` to apply the `to_numeric()`
-   All dtypes converted to float
-   All errors managed (replaced with 0s)

In [20]:
df_clean = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df_clean.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

# `df.apply(<fn>, <params>)` basically applies the function `fn` with parameters `params` to the entire dataframe `df` <mark style="background: #FFF3A3A6;">Noel very important</mark>

## 7. Reduce DataFrame size

In [22]:
drinks.info(memory_usage='deep') # see usage on memory

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

### 7.1 Only read in desired cols (`usecols` parameter)

In [23]:
cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB

### 7.2 Convert categorical levels to the "category" data type (`dtype` parameter)

Be sensible. If there's a small number of categorical levels, instead of leaving them as "object" dtype, use a dict to convert them to "category" dtype

In [24]:
dtypes = {'continent':'category'} # dict to convert the datatype
smaller_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols, dtype=dtypes)
smaller_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

### 8. Build a DataFrame from multiple files:

**Note:** We don't have the necessary files

### 8.1 Row-wise build:

In this example, there are 3 `.csv` files, each with 1 day of stock data (i.e. each file has the **same columns**)

In [25]:
### I don't have these files
# pd.read_csv('data/stocks1.csv')
# pd.read_csv('data/stocks2.csv')
# pd.read_csv('data/stocks3.csv')

Do the following:

In [ ]:
from glob import glob

# get file names of all CSV files in the data/ directory starting with the word stocks
stock_files = sorted(glob('data/stocks*.csv'))

# concatenate these iteratively (generator (in-line) function). 
# Ignore index to delete original file indices
# Note, the axis by default is row!
pd.concat((pd.read_csv(file) for file in stock_files), ignore_index=True)

### 8.2 Column-wise build:

Here, each file contains information about the same rows, but **different columns** from the data

In [ ]:
from glob import glob

# get file names
drink_files = sorted(glob('data/drinks*.csv'))

# concatenate iteratively again, this time specifying the axis
pd.concat((pd.read_csv(file) for file in drink_files), axis='columns').head()

### 8.3 Create a DataFrame from the clipboard

Again, don't have this enabled, but pandas is **smart** it can figure out dtypes and even the index column

In [ ]:
df = pd.read_clipboard()
df.dtypes
df.index

## 9. Split the DataFrame into two random subsets using the `.sample()` and `.drop()` methods

Randomly assign 75% of the observations to one dataframe, the other 25% to a second dataframe using the `.sample()` method Note, you can use `.drop()` to drop rows that are in movies_1, and assign the remaining rows to movies_2

In [27]:
# put a random 75% of rows into movies_1
movies_1 = movies.sample(frac=0.75, random_state=1234)

# put the other 25% into movies_2 (use .drop() to drop rows that are in movies_1, and assign the remaining rows to movies_2)
movies_2 = movies.drop(movies_1.index)

CHECK all observations are accounted for

In [28]:
print(len(movies) == len(movies_1) + len(movies_2))
print(movies_1.index.sort_values()) # looking at the index numbers...
print(movies_2.index.sort_values()) # ... we see ALL are accounted for!

True
Int64Index([  0,   2,   5,   6,   7,   8,   9,  11,  13,  16,
            ...
            966, 967, 969, 971, 972, 974, 975, 976, 977, 978],
           dtype='int64', length=734)
Int64Index([  1,   3,   4,  10,  12,  14,  15,  18,  26,  30,
            ...
            931, 934, 937, 941, 950, 954, 960, 968, 970, 973],
           dtype='int64', length=245)

Note, indices must be unique for this to work

## 10. Filtering DataFrames (i.e. creating masks)

Use the movies DataFrame for this example

### 10.1 By multiple categories

In [29]:
# inspect the dataframe
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [30]:
# Inspect the genre variable's unique values:
# NOTE, these are identical statements
movies['genre'].unique()
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

# **Create a mask to filter data (by multiple categories) using the `.isin(["A", "B"])` method**

In [31]:
# Noel important
# create (initialise) the mask
favourite_genres_mask = movies.genre.isin(["Action", "Drama", "Western"])

# apply mask filter the data
movies[favourite_genres_mask].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."

In [32]:
# apply the reverse filter (exclude my favourite movies)
movies[~favourite_genres_mask].head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."

### 10.2 By largest categories (use the `.value_counts()` and `.nlargest()` functions)

In this example, we are only interested in the **3 largest genres**

In [33]:
# select the 3 largest categories 
counts = movies.genre.value_counts()
print(counts)
print('\n3 largest genres:')
print(counts.nlargest(3))

Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Sci-Fi         5
Thriller       5
Film-Noir      3
Family         2
History        1
Fantasy        1
Name: genre, dtype: int64

3 largest genres:
Drama     278
Comedy    156
Action    136
Name: genre, dtype: int64

#### In reality, our mask only needs the index of this new series (i.e. list with names of the 3 largest genres)

In [34]:
print(counts.nlargest(3).index)

# create mask (Noel important)
largest_three_genres_mask = movies.genre.isin(counts.nlargest(3).index)

# apply mask to filter the data
movies[largest_three_genres_mask].head()

Index(['Drama', 'Comedy', 'Action'], dtype='object')

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."

## 11. Handle missing values

### 11.1 To find how many missing values in each column

### 11.2 Drop columns with missing values

### 11.3 Drop columns with >10% missing values

### 11.4 Drop rows with missing values

## 12. Split a string into multiple columns

### 12.1 We can split columns (e.g. first, middle, last name) using the `.str.split()` method

## 13. Expand a Series of lists into a DataFrame (Noel important section)

## 14. Aggregations - Noel very important!

### 14.1 Aggregation by multiple functions (use `.groupby()` function)

#### 14.1.1 The total price for every order `.groupby()` on `order_id` _(also see the `.transform()` method in 14.2)_

#### 14.1.2 `.groupby()` is extremely powerful. You can pass several aggregation methods (use `.agg([])` )other than just using `.sum()` <- Noel very important

### 14.2 Combine the output of an aggregation with a DataFrame

## 15. Select a slice of rows and columns

## 16. Reshape a multi-indexed Series using `.unstack()` <- Noel important

## 17. Create a pivot table <- Noel very important section

## 18. Convert continuous data into categorical data (bins) using `pd.cut()` <- Noel very important

## 19. Change display options

## 20. Style a DataFrame